import requests
from bs4 import BeautifulSoup
import os
import multiprocessing
import difflib
from difflib import SequenceMatcher
from heapq import nlargest as _nlargest

lst = [['/228_228898/', '一剑逐仙'], ['/204_204058/', '一剑曾挡百万兵'], ['/182_182084/', '修仙三百年突然发现是武侠'],
       ['/117_117966/', '长生从大道争锋开始'], ['/105_105716/', '六道仙尊'], ['/85_85296/', '洪荒之连呼吸都在变强'],
       ['/53_53210/', '谢邀，人在洪荒，拒绝妖皇'], ['/39_39352/', '我体内有仙府洞天'], ['/5_5414/', '至尊龙帝陆鸣'], ['/2_2136/', '万道龙皇免费完整版'],
       ['/278_278910/', '仙路纵火犯'], ['/278_278858/', '江湖醉得意'], ['/278_278856/', '神医侠女'], ['/278_278686/', '战歌擂'],
       ['/278_278626/', '归墟之门'], ['/278_278574/', '我靠吟诗成儒圣'], ['/278_278384/', '封神：吾为人皇，开局创建聊天群'],
       ['/278_278368/', '苟在仙界成大佬'], ['/278_278362/', '为了修仙，开局加入百花宗'], ['/278_278336/', '太阴仙途'],
       ['/278_278302/', '道化山河'], ['/278_278300/', '开局：我被校花送入遮天'], ['/278_278260/', '天道善恶图']]
# lst = ['/228_228898/', '一剑逐仙']

book_name = str(input('书本编号采集完毕!!!'
                      '请输入关键词：'))
xz_list = []
for xb in lst:
    print(xb)
    if book_name in xb[1]:
        xz_list.append(xb)
print(xz_list)
